// Создаем массив asideThemes с темами для блока aside
export const asideThemes = [
  'Конспект книги<br>2016 МакГрат',
  'Конспект книги<br>2001 Крупник',
  'Конспект книги<br>1988 Болски',
  'Конспект книги<br>2008 Иванов',
  'Конспект книги<br>2007 Яновский 1',
  'Конспект книги<br>2009 Костюкова',
  'Конспект книги<br>1985 Керниган',
  'Конспект книги<br>2007 Яновский 2',
  'Конспект книги<br>2015 Кузин',
  'Конспект книги<br>1988 Джехани',
  'Конспект книги<br>2019 Кольцов',
  'Конспект книги<br>2020 Дейтел',
  'Конспект книги<br>1988 Уэйт',
];
