// Создаем массив asideThemes с темами для блока aside
export const asideThemes = [
  '1 Основы C++ 1 Вводное занятие',
  '2 Основы C++ 2 vector, cmath',
  '3 Основы c++ 3 string',
  '4 Основы C++ 4 Функции',
  '5 Основы c++ 5 Линейные алгоритмы',
  '6 Алгоритмы 1 Префикс функции',
  '7 Алгоритмы 2 Два указателя',
  '8 Структуры данных 1 stack, queue, deque',
  '9 Алгоритмы 3 Бинарный поиск',
  '10 Алгоритмы 4 Бинарный поиск по ответу',
  '11 Алгоритмы 5 Бинарный поиск вещественный',
  '12 Структуры данных 2 set, map',
  '13 Математика 1 Теория чисел',
  '14 Алгоритмы 6 Битовые операции',
];
